app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."full_name" = $1 LIMIT $2  [["full_name", "Calvin"], ["LIMIT", 1]]
---
    def create
        full_name = params[:full_name]
        password = params[:password]

        user = User.find_by(full_name: full_name)