app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("full_name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["full_name", "Calvin Tantio"], ["email", "calvin.tantio@yahoo.com"], ["password", "Whatever"], ["created_at", "2017-10-08 10:07:58.193714"], ["updated_at", "2017-10-08 10:07:58.193714"]]

  def update
    user = User.find(params[:id])

    if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "full_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["full_name", "Ivan"], ["updated_at", "2017-10-22 07:25:32.808411"], ["id", 1]]